<!doctype html>
<html lang="zh-CN">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width">
  <title>文件描述符 | Node.js API 文档</title>
  <link rel="icon" sizes="32x32" type="image/png" href="http://static.nodejs.cn/_static/img/favicon.png"><link rel="stylesheet" href="/api/api.css">
  <script>
    document.write('<link href="http://nodejs.cn/api/fs/'&#32;+&#32;(location.port?'':'//static.nodejs.cn')&#32;+&#32;'/_static/css/api.css?1576756309478" rel="stylesheet">')
  </script>
</head>
<body class="alt apidoc" id="page_api_item">
  <div id="api-section-fs">
    <div id="content" class="clearfix">
  
      <div id="column1" data-id="__ID__" class="interior">
        <header>
          <h1>文件描述符</h1>
          <div id="gtoc">
            <ul>
              <li>v12.14.0</li>
              <li>
                <a href="../fs.html#fs_file_descriptors" name="toc">返回上层文档</a>
              </li>
              <li>
                <a href="https://github.com/nodejscn/node-api-cn/edit/master/fs/file_descriptors.md" rel="nofollow" target="_blank">提交修改</a>
              </li>
              <li>
                <a href="http://nodejs.cn/search" name="toc">搜索</a>
              </li>
            </ul>
          </div>
          <hr>
        </header>

        <div id="biz_item"></div>
  
        <div id="apicontent">
          <div id="content_left"><p>&#x5728; POSIX &#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5185;&#x6838;&#x90FD;&#x7EF4;&#x62A4;&#x7740;&#x4E00;&#x5F20;&#x5F53;&#x524D;&#x6253;&#x5F00;&#x7740;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x8D44;&#x6E90;&#x7684;&#x8868;&#x683C;&#x3002;
&#x6BCF;&#x4E2A;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x90FD;&#x5206;&#x914D;&#x4E86;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x7684;&#x7B80;&#x5355;&#x7684;&#x6570;&#x5B57;&#x6807;&#x8BC6;&#x7B26;&#x3002;
&#x5728;&#x7CFB;&#x7EDF;&#x5C42;&#xFF0C;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x64CD;&#x4F5C;&#x90FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6765;&#x6807;&#x8BC6;&#x548C;&#x8DDF;&#x8E2A;&#x6BCF;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x3002;
Windows &#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x867D;&#x7136;&#x4E0D;&#x540C;&#x4F46;&#x6982;&#x5FF5;&#x4E0A;&#x7C7B;&#x4F3C;&#x7684;&#x673A;&#x5236;&#x6765;&#x8DDF;&#x8E2A;&#x8D44;&#x6E90;&#x3002;
&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x7528;&#x6237;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;Node.js &#x62BD;&#x8C61;&#x51FA;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x7279;&#x5B9A;&#x5DEE;&#x5F02;&#xFF0C;&#x5E76;&#x4E3A;&#x6240;&#x6709;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x578B;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;</p><p><code>fs.open()</code> &#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x5206;&#x914D;&#x65B0;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;
&#x4E00;&#x65E6;&#x88AB;&#x5206;&#x914D;&#xFF0C;&#x5219;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x53EF;&#x7528;&#x4E8E;&#x4ECE;&#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3001;&#x5411;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x6570;&#x636E;&#x3001;&#x6216;&#x8BF7;&#x6C42;&#x5173;&#x4E8E;&#x6587;&#x4EF6;&#x7684;&#x4FE1;&#x606F;&#x3002;</p><pre><code class="language-js">fs.open(&apos;/open/some/file.txt&apos;, &apos;r&apos;, (err, fd) =&gt; {
  if (err) throw err;
  fs.fstat(fd, (err, stat) =&gt; {
    if (err) throw err;
    // &#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x5C5E;&#x6027;&#x3002;

    // &#x59CB;&#x7EC8;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF01;
    fs.close(fd, (err) =&gt; {
      if (err) throw err;
    });
  });
});
</code></pre><p>&#x5927;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9650;&#x5236;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x53EF;&#x80FD;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x65F6;&#x5173;&#x95ED;&#x63CF;&#x8FF0;&#x7B26;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;
&#x5982;&#x679C;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#x5C06;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x3002;</p></div>
          <div id="content_right"><p>On POSIX systems, for every process, the kernel maintains a table of currently
open files and resources. Each open file is assigned a simple numeric
identifier called a <em>file descriptor</em>. At the system-level, all file system
operations use these file descriptors to identify and track each specific
file. Windows systems use a different but conceptually similar mechanism for
tracking resources. To simplify things for users, Node.js abstracts away the
specific differences between operating systems and assigns all open files a
numeric file descriptor.</p><p>The <code>fs.open()</code> method is used to allocate a new file descriptor. Once
allocated, the file descriptor may be used to read data from, write data to,
or request information about the file.</p><pre><code class="language-js">fs.open(&apos;/open/some/file.txt&apos;, &apos;r&apos;, (err, fd) =&gt; {
  if (err) throw err;
  fs.fstat(fd, (err, stat) =&gt; {
    if (err) throw err;
    // use stat

    // always close the file descriptor!
    fs.close(fd, (err) =&gt; {
      if (err) throw err;
    });
  });
});
</code></pre><p>Most operating systems limit the number of file descriptors that may be open
at any given time so it is critical to close the descriptor when operations
are completed. Failure to do so will result in a memory leak that will
eventually cause an application to crash.</p></div>
          <div></div>
        </div>
      </div>
    </div>
  </div>
  <script>
    document.write('<script src="http://nodejs.cn/api/fs/'&#32;+&#32;(location.port&#32;?&#32;''&#32;:&#32;'//static.nodejs.cn')&#32;+&#32;'/_static/js/api.js?1576756309478"><\/script>');
  </script>
</body>
</html>