<!doctype html>
<html lang="zh-CN">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width">
  <title>工作原理 | Node.js API 文档</title>
  <link rel="icon" sizes="32x32" type="image/png" href="http://static.nodejs.cn/_static/img/favicon.png"><link rel="stylesheet" href="/api/api.css">
  <script>
    document.write('<link href="http://nodejs.cn/api/cluster/'&#32;+&#32;(location.port?'':'//static.nodejs.cn')&#32;+&#32;'/_static/css/api.css?1576756297723" rel="stylesheet">')
  </script>
</head>
<body class="alt apidoc" id="page_api_item">
  <div id="api-section-cluster">
    <div id="content" class="clearfix">
  
      <div id="column1" data-id="__ID__" class="interior">
        <header>
          <h1>工作原理</h1>
          <div id="gtoc">
            <ul>
              <li>v12.14.0</li>
              <li>
                <a href="../cluster.html#cluster_how_it_works" name="toc">返回上层文档</a>
              </li>
              <li>
                <a href="https://github.com/nodejscn/node-api-cn/edit/master/cluster/how_it_works.md" rel="nofollow" target="_blank">提交修改</a>
              </li>
              <li>
                <a href="http://nodejs.cn/search" name="toc">搜索</a>
              </li>
            </ul>
          </div>
          <hr>
        </header>

        <div id="biz_item"></div>
  
        <div id="apicontent">
          <div id="content_left"><p>&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x7531; <a href="http://nodejs.cn/s/VDCJMa" rel="nofollow"><code>child_process.fork()</code></a> &#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; IPC &#x548C;&#x7236;&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5404;&#x8FDB;&#x7A0B;&#x4EA4;&#x66FF;&#x5904;&#x7406;&#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x3002;</p><p>cluster &#x6A21;&#x5757;&#x652F;&#x6301;&#x4E24;&#x79CD;&#x5206;&#x53D1;&#x8FDE;&#x63A5;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p><p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF08;&#x4E5F;&#x662F;&#x9664; Windows &#x5916;&#x6240;&#x6709;&#x5E73;&#x53F0;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#xFF09;&#x662F;&#x5FAA;&#x73AF;&#x6CD5;&#xFF0C;&#x7531;&#x4E3B;&#x8FDB;&#x7A0B;&#x8D1F;&#x8D23;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#xFF0C;&#x63A5;&#x6536;&#x65B0;&#x8FDE;&#x63A5;&#x540E;&#x518D;&#x5C06;&#x8FDE;&#x63A5;&#x5FAA;&#x73AF;&#x5206;&#x53D1;&#x7ED9;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#xFF0C;&#x5728;&#x5206;&#x53D1;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x6280;&#x5DE7;&#x9632;&#x6B62;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x4EFB;&#x52A1;&#x8FC7;&#x8F7D;&#x3002;</p><p>&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x4E3B;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x76D1;&#x542C; socket &#x540E;&#x53D1;&#x9001;&#x7ED9;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#xFF0C;&#x7531;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x8D1F;&#x8D23;&#x76F4;&#x63A5;&#x63A5;&#x6536;&#x8FDE;&#x63A5;&#x3002;</p><p>&#x7406;&#x8BBA;&#x4E0A;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x662F;&#x6548;&#x7387;&#x6700;&#x4F73;&#x7684;&#x3002;
&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x673A;&#x5236;&#x7684;&#x96BE;&#x4EE5;&#x6349;&#x6478;&#xFF0C;&#x4F1A;&#x4F7F;&#x5206;&#x53D1;&#x53D8;&#x5F97;&#x4E0D;&#x7A33;&#x5B9A;&#x3002;
&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x516B;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x5206;&#x62C5;&#x4E86; 70% &#x7684;&#x8D1F;&#x8F7D;&#x3002;</p><p>&#x56E0;&#x4E3A; <code>server.listen()</code> &#x5C06;&#x5927;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x4EA4;&#x7ED9;&#x4E3B;&#x8FDB;&#x7A0B;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x5BFC;&#x81F4;&#x666E;&#x901A; Node.js &#x8FDB;&#x7A0B;&#x4E0E; cluster &#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x5DEE;&#x5F02;&#x7684;&#x60C5;&#x51B5;&#x6709;&#x4E09;&#x79CD;&#xFF1A;</p><ol>
<li><code>server.listen({fd: 7})</code> &#x56E0;&#x4E3A;&#x6D88;&#x606F;&#x4F1A;&#x88AB;&#x4F20;&#x7ED9;&#x4E3B;&#x8FDB;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x7236;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26; 7 &#x5C06;&#x4F1A;&#x88AB;&#x76D1;&#x542C;&#x5E76;&#x5C06;&#x53E5;&#x67C4;&#x4F20;&#x7ED9;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76D1;&#x542C;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26; 7 &#x6307;&#x5411;&#x7684;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x3002;</li>
<li><code>server.listen(handle)</code> &#x663E;&#x5F0F;&#x5730;&#x76D1;&#x542C;&#x53E5;&#x67C4;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x8BE5;&#x53E5;&#x67C4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x548C;&#x4E3B;&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#x3002;</li>
<li><code>server.listen(0)</code> &#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x79CD;&#x8C03;&#x7528;&#x4F1A;&#x5BFC;&#x81F4; server &#x5728;&#x968F;&#x673A;&#x7AEF;&#x53E3;&#x4E0A;&#x76D1;&#x542C;&#x3002;
&#x4F46;&#x5728; cluster &#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x6BCF;&#x6B21;&#x8C03;&#x7528; <code>listen(0)</code> &#x65F6;&#x4F1A;&#x6536;&#x5230;&#x76F8;&#x540C;&#x7684;&#x201C;&#x968F;&#x673A;&#x201D;&#x7AEF;&#x53E3;&#x3002;
&#x5B9E;&#x8D28;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x7AEF;&#x53E3;&#x53EA;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x5206;&#x914D;&#x65F6;&#x968F;&#x673A;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x53D8;&#x5F97;&#x53EF;&#x9884;&#x6599;&#x3002;
&#x5982;&#x679C;&#x8981;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x7AEF;&#x53E3;&#x7684;&#x8BDD;&#xFF0C;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x7684; ID &#x6765;&#x751F;&#x6210;&#x7AEF;&#x53E3;&#x53F7;&#x3002;</li>
</ol><p>Node.js &#x4E0D;&#x652F;&#x6301;&#x8DEF;&#x7531;&#x903B;&#x8F91;&#x3002;
&#x56E0;&#x6B64;&#x5728;&#x8BBE;&#x8BA1;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x8FC7;&#x5206;&#x4F9D;&#x8D56;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982; session &#x548C;&#x767B;&#x9646;&#x7B49;&#x3002;</p><p>&#x7531;&#x4E8E;&#x5404;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x968F;&#x65F6;&#x5173;&#x95ED;&#x6216;&#x91CD;&#x65B0;&#x751F;&#x6210;&#xFF0C;&#x800C;&#x4E0D;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;
&#x53EA;&#x8981;&#x6709;&#x5B58;&#x6D3B;&#x7684;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x8FDE;&#x63A5;&#x3002;
&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B58;&#x6D3B;&#x7684;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#xFF0C;&#x73B0;&#x6709;&#x8FDE;&#x63A5;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x65B0;&#x7684;&#x8FDE;&#x63A5;&#x4E5F;&#x4F1A;&#x88AB;&#x62D2;&#x7EDD;&#x3002;
Node.js &#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x7531;&#x5177;&#x4F53;&#x7684;&#x5E94;&#x7528;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x6765;&#x7BA1;&#x7406;&#x8FDB;&#x7A0B;&#x6C60;&#x3002;</p><p>&#x867D;&#x7136; <code>cluster</code> &#x6A21;&#x5757;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x7F51;&#x7EDC;&#x76F8;&#x5173;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x9700;&#x8981;&#x5DE5;&#x4F5C;&#x8FDB;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x3002;</p></div>
          <div id="content_right"><p>The worker processes are spawned using the <a href="http://nodejs.cn/s/VDCJMa" rel="nofollow"><code>child_process.fork()</code></a> method,
so that they can communicate with the parent via IPC and pass server
handles back and forth.</p><p>The cluster module supports two methods of distributing incoming
connections.</p><p>The first one (and the default one on all platforms except Windows),
is the round-robin approach, where the master process listens on a
port, accepts new connections and distributes them across the workers
in a round-robin fashion, with some built-in smarts to avoid
overloading a worker process.</p><p>The second approach is where the master process creates the listen
socket and sends it to interested workers. The workers then accept
incoming connections directly.</p><p>The second approach should, in theory, give the best performance.
In practice however, distribution tends to be very unbalanced due
to operating system scheduler vagaries. Loads have been observed
where over 70% of all connections ended up in just two processes,
out of a total of eight.</p><p>Because <code>server.listen()</code> hands off most of the work to the master
process, there are three cases where the behavior between a normal
Node.js process and a cluster worker differs:</p><ol>
<li><code>server.listen({fd: 7})</code> Because the message is passed to the master,
file descriptor 7 <strong>in the parent</strong> will be listened on, and the
handle passed to the worker, rather than listening to the worker&apos;s
idea of what the number 7 file descriptor references.</li>
<li><code>server.listen(handle)</code> Listening on handles explicitly will cause
the worker to use the supplied handle, rather than talk to the master
process.</li>
<li><code>server.listen(0)</code> Normally, this will cause servers to listen on a
random port. However, in a cluster, each worker will receive the
same &quot;random&quot; port each time they do <code>listen(0)</code>. In essence, the
port is random the first time, but predictable thereafter. To listen
on a unique port, generate a port number based on the cluster worker ID.</li>
</ol><p>Node.js does not provide routing logic. It is, therefore important to design an
application such that it does not rely too heavily on in-memory data objects for
things like sessions and login.</p><p>Because workers are all separate processes, they can be killed or
re-spawned depending on a program&apos;s needs, without affecting other
workers. As long as there are some workers still alive, the server will
continue to accept connections. If no workers are alive, existing connections
will be dropped and new connections will be refused. Node.js does not
automatically manage the number of workers, however. It is the application&apos;s
responsibility to manage the worker pool based on its own needs.</p><p>Although a primary use case for the <code>cluster</code> module is networking, it can
also be used for other use cases requiring worker processes.</p></div>
          <div></div>
        </div>
      </div>
    </div>
  </div>
  <script>
    document.write('<script src="http://nodejs.cn/api/cluster/'&#32;+&#32;(location.port&#32;?&#32;''&#32;:&#32;'//static.nodejs.cn')&#32;+&#32;'/_static/js/api.js?1576756297723"><\/script>');
  </script>
</body>
</html>