<!doctype html>
<html lang="zh-CN">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width">
  <title>警告: 正确地使用 'uncaughtException' | Node.js API 文档</title>
  <link rel="icon" sizes="32x32" type="image/png" href="http://static.nodejs.cn/_static/img/favicon.png"><link rel="stylesheet" href="/api/api.css">
  <script>
    document.write('<link href="http://nodejs.cn/api/process/'&#32;+&#32;(location.port?'':'//static.nodejs.cn')&#32;+&#32;'/_static/css/api.css?1576756320962" rel="stylesheet">')
  </script>
</head>
<body class="alt apidoc" id="page_api_item">
  <div id="api-section-process">
    <div id="content" class="clearfix">
  
      <div id="column1" data-id="__ID__" class="interior">
        <header>
          <h1>警告: 正确地使用 'uncaughtException'</h1>
          <div id="gtoc">
            <ul>
              <li>v12.14.0</li>
              <li>
                <a href="../process.html#process_warning_using_uncaughtexception_correctly" name="toc">返回上层文档</a>
              </li>
              <li>
                <a href="https://github.com/nodejscn/node-api-cn/edit/master/process/warning_using_uncaughtexception_correctly.md" rel="nofollow" target="_blank">提交修改</a>
              </li>
              <li>
                <a href="http://nodejs.cn/search" name="toc">搜索</a>
              </li>
            </ul>
          </div>
          <hr>
        </header>

        <div id="biz_item"></div>
  
        <div id="apicontent">
          <div id="content_left"><p>&#x5982;&#x679C;&#x6253;&#x7B97;&#x4F7F;&#x7528; <code>&apos;uncaughtException&apos;</code> &#x4E8B;&#x4EF6;&#x4F5C;&#x4E3A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x6700;&#x540E;&#x8865;&#x6551;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x7C97;&#x7CD9;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#x3002;
&#x6B64;&#x4E8B;&#x4EF6;&#x4E0D;&#x5E94;&#x8BE5;&#x5F53;&#x4F5C; <code>On Error Resume Next</code>&#xFF08;&#x51FA;&#x4E86;&#x9519;&#x8BEF;&#x5C31;&#x6062;&#x590D;&#x8BA9;&#x5B83;&#x7EE7;&#x7EED;&#xFF09;&#x7684;&#x7B49;&#x4EF7;&#x673A;&#x5236;&#x3002;
&#x672A;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x672C;&#x8EAB;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5E94;&#x7528;&#x5DF2;&#x7ECF;&#x5904;&#x4E8E;&#x4E86;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x57FA;&#x4E8E;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x5C1D;&#x8BD5;&#x6062;&#x590D;&#x5E94;&#x7528;&#x6B63;&#x5E38;&#x8FDB;&#x884C;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x672A;&#x77E5;&#x6216;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x95EE;&#x9898;&#x3002;</p><p>&#x6B64;&#x4E8B;&#x4EF6;&#x7684;&#x76D1;&#x542C;&#x5668;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E2D;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x4E0D;&#x4F1A;&#x88AB;&#x6355;&#x83B7;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FDB;&#x7A0B;&#x4F1A;&#x4EE5;&#x975E;&#x96F6;&#x7684;&#x72B6;&#x6001;&#x7801;&#x7ED3;&#x675F;&#xFF0C;&#x5E76;&#x6253;&#x5370;&#x5806;&#x6808;&#x4FE1;&#x606F;&#x3002;</p><p>&#x5982;&#x679C;&#x5728;&#x51FA;&#x73B0;&#x672A;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x5C1D;&#x8BD5;&#x53BB;&#x6062;&#x590D;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x7ED3;&#x679C;&#x4E0E;&#x7535;&#x8111;&#x5347;&#x7EA7;&#x65F6;&#x62D4;&#x6389;&#x7535;&#x6E90;&#x7EBF;&#x51FA;&#x73B0;&#x7684;&#x7ED3;&#x679C;&#x7C7B;&#x4F3C;&#x3002;
10&#x6B21;&#x4E2D;&#x6709;9&#x6B21;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;
&#x4F46;&#x662F;&#x7B2C;10&#x6B21;&#x53EF;&#x80FD;&#x7CFB;&#x7EDF;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;</p><p>&#x6B63;&#x786E;&#x4F7F;&#x7528; <code>&apos;uncaughtException&apos;</code> &#x4E8B;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x662F;&#x7528;&#x5B83;&#x5728;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x524D;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x5DF2;&#x5206;&#x914D;&#x8D44;&#x6E90;&#xFF08;&#x6BD4;&#x5982;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x53E5;&#x67C4;&#x7B49;&#x7B49;&#xFF09;&#x7684;&#x540C;&#x6B65;&#x6E05;&#x7406;&#x64CD;&#x4F5C;&#x3002;
&#x89E6;&#x53D1; <code>&apos;uncaughtException&apos;</code> &#x4E8B;&#x4EF6;&#x540E;&#xFF0C;&#x7528;&#x5B83;&#x6765;&#x5C1D;&#x8BD5;&#x6062;&#x590D;&#x5E94;&#x7528;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x3002;</p><p>&#x60F3;&#x8BA9;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5D29;&#x6E83;&#x7684;&#x5E94;&#x7528;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x66F4;&#x53EF;&#x9760;&#x7684;&#x65B9;&#x5F0F;&#x5E94;&#x8BE5;&#x662F;&#x542F;&#x52A8;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6765;&#x76D1;&#x6D4B;/&#x63A2;&#x6D4B;&#x5E94;&#x7528;&#x662F;&#x5426;&#x51FA;&#x9519;&#xFF0C;
&#x65E0;&#x8BBA; <code>uncaughtException</code> &#x4E8B;&#x4EF6;&#x662F;&#x5426;&#x88AB;&#x89E6;&#x53D1;&#xFF0C;&#x5982;&#x679C;&#x76D1;&#x6D4B;&#x5230;&#x5E94;&#x7528;&#x51FA;&#x9519;&#xFF0C;&#x5219;&#x6062;&#x590D;&#x6216;&#x91CD;&#x542F;&#x5E94;&#x7528;&#x3002;</p></div>
          <div id="content_right"><p><code>&apos;uncaughtException&apos;</code> is a crude mechanism for exception handling
intended to be used only as a last resort. The event <em>should not</em> be used as
an equivalent to <code>On Error Resume Next</code>. Unhandled exceptions inherently mean
that an application is in an undefined state. Attempting to resume application
code without properly recovering from the exception can cause additional
unforeseen and unpredictable issues.</p><p>Exceptions thrown from within the event handler will not be caught. Instead the
process will exit with a non-zero exit code and the stack trace will be printed.
This is to avoid infinite recursion.</p><p>Attempting to resume normally after an uncaught exception can be similar to
pulling out the power cord when upgrading a computer. Nine out of ten
times, nothing happens. But the tenth time, the system becomes corrupted.</p><p>The correct use of <code>&apos;uncaughtException&apos;</code> is to perform synchronous cleanup
of allocated resources (e.g. file descriptors, handles, etc) before shutting
down the process. <strong>It is not safe to resume normal operation after
<code>&apos;uncaughtException&apos;</code>.</strong></p><p>To restart a crashed application in a more reliable way, whether
<code>&apos;uncaughtException&apos;</code> is emitted or not, an external monitor should be employed
in a separate process to detect application failures and recover or restart as
needed.</p></div>
          <div></div>
        </div>
      </div>
    </div>
  </div>
  <script>
    document.write('<script src="http://nodejs.cn/api/process/'&#32;+&#32;(location.port&#32;?&#32;''&#32;:&#32;'//static.nodejs.cn')&#32;+&#32;'/_static/js/api.js?1576756320962"><\/script>');
  </script>
</body>
</html>